emacs/emacs_config.org
itle: Emacs Configuration
#+PROPERTY: header-Ares :results none :tangle ~/.emacs.d/init.el
#+auto_tangle: t


* About this config
This is my first attempt at a fully-feature emacs configuration. In many ways, I have little idea of what I'm doing. I've used emacs for years without these features, but with the advent of LSP would like to learn more about to make emacs work the best for my workflow as possible. I've learned a lot via DOOM emacs, but now I want to ensure I have a system that caters to my personal need.

* Setup:
I got tired of emacs asking if it was ok to follow a symliink on every boot and the attempts I made to suppress that didn't work. So instead, we tangle directly to =init.el= and save this org file under version control.

** Define where we go for packages

** Straight.el
#+begin_src emacs-lisp :tangle ~/.emacs.d/init.el 
(defvar bootstrap-version)
(let ((bootstrap-file
       (expand-file-name "straight/repos/straight.el/bootstrap.el" user-emacs-directory))
      (bootstrap-version 6))
  (unless (file-exists-p bootstrap-file)
    (with-current-buffer
        (url-retrieve-synchronously
         "https://raw.githubusercontent.com/radian-software/straight.el/develop/install.el"
         'silent 'inhibit-cookies)
      (goto-char (point-max))
      (eval-print-last-sexp)))
  (load bootstrap-file nil 'nomessage))
#+end_src

#+RESULTS:
: t

** Setup use-package

#+BEGIN_SRC emacs-lisp :results none :tangle ~/.emacs.d/init.el
  ;;Initalize use-package
  (unless (package-installed-p 'use-package)
  (package-install 'use-package))

  (require 'use-package)



#+END_SRC
* Initial Quick setup
These are the random one-off configurations that help make Emacs better, but didn't fall into a great category.  Things like removing the unneeded ui elements from the screen or suppressing annoying dialogs that you always answer yes to.
** Remove some of the features of the UI that we don't need (toolbars, menubars, scroll bars, and splash screen)
#+BEGIN_SRC emacs-lisp  :tangle ~/.emacs.d/init.el
  ;;-*- lexical-binding: t; -*-
  ;; Don't show the splash screen
  (setq inhibit-startup-message t)
  (setq initial-buffer-choice nil)
  ;; Tune garbage collection
  (setq gc-cons-threshold (* 50 1000 1000))

  ;; Turn off some unneeded UI Elements
  (menu-bar-mode -1)
  (tool-bar-mode -1)
  (scroll-bar-mode -1)
  (display-time-mode 1)
#+END_SRC

#+RESULTS:
: t

** Make deleted files go to trash
#+begin_src emacs-lisp :tangle ~/.emacs.d/init.el 
  (setq delete-by-moving-to-trash t
trash-directory "~/.local/share/Trash/files/")
#+end_src

#+RESULTS:
: ~/.local/share/Trash/files/

** Turn on beacon
#+begin_src emacs-lisp :tangle ~/.emacs.d/init.el 
  (use-package beacon
  :straight (beacon :fetcher github :repo "Malabarba/beacon")
    :ensure t
    :config
    (beacon-mode +1))
#+end_src

#+RESULTS:
: t

** DONE Suppress execute confirm
CLOSED: [2022-12-28 Wed 17:26]
#+begin_src emacs-lisp :tangle ~/.emacs.d/init.el 
 (setq org-confirm-babel-evaluate nil)
#+end_src

#+RESULTS:

** DONE Keep little files from littering
CLOSED: [2022-12-28 Wed 18:13]

** DONE Suppress compiler warnings
CLOSED: [2022-12-28 Wed 17:27]
#+begin_src emacs-lisp :tangle ~/.emacs.d/init.el 

;; Silence compiler warnings as they can be pretty disruptive
(setq native-comp-async-report-warnings-errors nil)

;; Set the right directory to store the native comp cache
(add-to-list 'native-comp-eln-load-path (expand-file-name "eln-cache/" user-emacs-directory))

#+end_src

#+RESULTS:
| /Users/rcool2/.emacs.d/eln-cache/ | /opt/homebrew/Cellar/emacs-plus@30/30.0.50/Emacs.app/Contents/native-lisp/ |

** Load custom lisp files
#+begin_src emacs-lisp :tangle ~/.emacs.d/init.el 
  (load (expand-file-name "rc-funcs.el" user-emacs-directory))
  (setq custom-file (expand-file-name "custom.el" user-emacs-directory))
  (load custom-file)
#+end_src

#+RESULTS:
: t

** Suppress emacs from asking if it should follow symlink files
#+begin_src emacs-lisp  :tangle ~/.emacs.d/init.el
(setq vc-follow-symlinks t)
(setq vc-suppress-confirm t)
#+end_src

#+RESULTS:
: t

** Turn on line numbers
#+BEGIN_SRC emacs-lisp  :tangle ~/.emacs.d/init.el
  ;; Turn on line numbers in every buffer
  (global-display-line-numbers-mode 1)
  ;; With vim bindings, relatives let us use j and k better
  (setq display-line-numbers-type 'relative)
#+END_SRC

#+RESULTS:
: relative

** Disable lockfiles
#+begin_src emacs-lisp  :tangle ~/.emacs.d/init.el
(setq create-lockfiles nil)
#+end_src

#+RESULTS:

** Line Highlighting and Fringe
#+BEGIN_SRC emacs-lisp  :tangle ~/.emacs.d/init.el
  ;; Turn on line highlithting for current line
  (hl-line-mode 1)
  ;; Add some margins
  (set-fringe-mode 10)
#+END_SRC

#+RESULTS:
: ((vertical-scroll-bars) (left-fringe . 10) (right-fringe . 10))

** Add escape to kill prompts
#+BEGIN_SRC emacs-lisp  :tangle ~/.emacs.d/init.el
  ;; Make escape kill prompts
  (global-set-key (kbd "<escape>") 'keyboard-escape-quit)
#+END_SRC

#+RESULTS:
: keyboard-escape-quit

** Keys for Mac
#+begin_src emacs-lisp  :tangle ~/.emacs.d/init.el
  (setq mac-command-modifier       'meta
        mac-option-modifier        'meta
        mac-control-modifier       'control
        mac-right-option-modifier     'meta
        mac-right-control-modifier  'control)
#+end_src

#+RESULTS:
: control

** DONE Turn on garbage collection
CLOSED: [2022-12-28 Wed 18:13]
#+begin_src emacs-lisp :tangle ~/.emacs.d/init.el 
    (use-package gcmh
    :diminish gcmh-mode
    :straight (gcmh-mode :host github :repo "akirak/gcmh")
    :config
    (setq gcmh-idle-delay 5
	  gcmh-high-cons-threshold (* 16 1024 1024))  ; 16mb
    (gcmh-mode 1))

  (add-hook 'emacs-startup-hook
	    (lambda ()
	      (setq gc-cons-percentage 0.1))) ;; Default value for `gc-cons-percentage'

  (add-hook 'emacs-startup-hook
	    (lambda ()
	      (message "Emacs ready in %s with %d garbage collections."
		       (format "%.2f seconds"
			       (float-time
				(time-subtract after-init-time before-init-time)))
		       gcs-done)))


#+end_src

#+RESULTS:
| lambda  | nil | (message Emacs ready in %s with %d garbage collections. (format %.2f seconds (float-time (time-subtract after-init-time before-init-time))) gcs-done) |                                                                                  |
| lambda  | nil | (setq gc-cons-percentage 0.1)                                                    |                                                                                  |
| closure | (t) | nil                                                                              | (message Emacs ready in %s with %d garbage collections. (format %.2f seconds (float-time (time-subtract after-init-time before-init-time))) gcs-done) |
| closure | (t) | nil                                                                              | (setq gc-cons-percentage 0.1)                                                    |

** Manage how new windows are placed
#+begin_src emacs-lisp :tangle ~/.emacs.d/init.el 
    (winner-mode +1)
  (setq display-buffer-base-action
    '((display-buffer-reuse-window
       display-buffer-reuse-mode-window
       display-buffer-same-window
       display-buffer-in-previous-window)))
#+end_src

#+RESULTS:: t


* Build the UI we want
** Install a better mode line

#+BEGIN_SRC emacs-lisp  :tangle ~/.emacs.d/init.el
    (use-package doom-modeline
  :straight (doom-modeline :repo "seagle0128/doom-modeline" :fetcher github)
      :ensure t
      :init (doom-modeline-mode 1)
      :config
      (setq doom-modeline-hud nil)
      (setq doom-modeline-minor-modes nil)
      (setq rc-doom-modeline-text-height 200)
      (setq doom-modeline-height 35)
      )
    (use-package all-the-icons
:straight (all-the-icons
 :repo "domtronn/all-the-icons.el"
 :fetcher github
 :files (:defaults "data"))
      :ensure t
      :if (display-graphic-p))

#+END_SRC

#+RESULTS:
: t

** Themes:
*** Setup Modus Themes

I like to do this even if I don't plan on the modus themes being my main theme of choice. I often swap themes, and this way they are ready when I want them.
#+BEGIN_SRC emacs-lisp  :tangle ~/.emacs.d/init.el
  (use-package modus-themes
  :ensure t
  :straight (modus-themes :fetcher sourcehut :repo "protesilaos/modus-themes")
  :init
  (setq modus-themes-hl-line '(intense)
  modus-themes-subtle-line-numbers nil
  modus-themes-region '(no-extend bg-only)
  modus-themes-variable-pitch-ui nil
  modus-themes-fringes 'intense
  modus-themes-diffs nil
  modus-themes-italic-constructs t
  modus-themes-bold-constructs  t
  modus-themes-prompts '( bold intense italic)
  modus-themes-intense-mouseovers t
  modus-themes-paren-match '(bold intense)
  modus-themes-syntax '( yellow-comments)
  modus-themes-links '(neutral-underline background)
  modus-themes-mode-line '(moody borderless accented 4 1)
  modus-themes-headings
   '((1 . (variable-pitch 1.1 rainbow))
                         (2 . (regular))
                         (3 . (regular))
                         (4 . (regular))
                         (t . (rainbow)))
  modus-themes-org-blocks `gray-background
   ))




#+END_SRC

** Mixed Pitch
A better verson of variable pitch.

#+begin_src emacs-lisp :tangle ~/.emacs.d/init.el 
  (use-package mixed-pitch
    :ensure t
    :straight (mixed-pitch :fetcher gitlab :repo "jabranham/mixed-pitch")
    :defer t
    :config
    (setq mixed-pitch-set-height nil)
    (dolist (face '(org-date org-priority org-tag org-special-keyword))
      (add-to-list 'mixed-pitch-fixed-pitch-faces face))
   )
#+end_src

#+RESULTS:

*** doom-themes
#+begin_src emacs-lisp  :tangle ~/.emacs.d/init.el
    (use-package doom-themes
    :straight t
    :after mixed-pitch
      :ensure t
      :config
      (setq doom-themes-enable-bold t
      doom-themes-enable-italic t)
      (load-theme 'doom-1337 t)

      (doom-themes-visual-bell-config)
      (doom-themes-neotree-config)
      (setq doom-themes-treemacs-theme "doom-atom")
      (doom-themes-treemacs-config)
      (doom-themes-org-config)
  )
  
    (load-theme 'doom-Iosvkem t)
  #+end_src

  #+RESULTS:

*** Kaolin Themes
#+begin_src emacs-lisp :tangle ~/.emacs.d/init.el 
    (use-package kaolin-themes 
    :straight (kaolin-themes
 :fetcher github
 :repo "ogdenwebb/emacs-kaolin-themes"
 :old-names (kaolin-theme)
 :files (:defaults "themes/*.el"))
      :ensure t
      :config
      (setq kaolin-themes-modeline-border nil)
  )
#+end_src
*** Ef-themes
#+begin_src emacs-lisp :tangle ~/.emacs.d/init.el 
    (use-package ef-themes
      :ensure t
      :straight (ef-themes :host github :repo "protesilaos/ef-themes")
      :init
      (setq ef-themes-headings
	    (quote ((1 . (variable-pitch 1.1))
		    (2 . (regular))
		    (3 . (regular))
		    (4 . (regular))))))
#+end_src



** Setup our fonts
#+BEGIN_SRC emacs-lisp  :tangle ~/.emacs.d/init.el
   (set-face-attribute 'default nil :family "PragmataProMonoLiga Nerd Font" :height 200)

   ;; Proportionally spaced typeface
   (set-face-attribute 'variable-pitch nil :family "Anonymice Nerd Font Mono" :height 1.0)

   ;; Monospaced typeface
   (set-face-attribute 'fixed-pitch nil :family "Spleen 32x64" :height 1.5)


   (if (facep 'mode-line-active)
       (set-face-attribute 'mode-line-active nil :family "Spleen 32x64" :height 200) ; For 29+
     (set-face-attribute 'mode-line nil :family "Spleen 32x64" :height 200))
  (set-face-attribute 'mode-line-inactive nil :family "Anonymice Nerd Font Mono" :height 200)
#+END_SRC

#+RESULTS:

** Update the help docs

#+BEGIN_SRC emacs-lisp  :tangle ~/.emacs.d/init.el
  (use-package helpful
  :straight (helpful :repo "Wilfred/helpful" :fetcher github)

    :ensure t)
  (global-set-key (kbd "C-c C-d") #'helpful-at-point)
  (global-set-key (kbd "C-h F") #'helpful-function)

  (global-set-key (kbd "C-h C") #'helpful-command)

#+END_SRC
** Popper.el - tame popups
#+begin_src emacs-lisp :tangle ~/.emacs.d/init.el 
  (use-package popper
  :straight (popper :fetcher github :repo "karthink/popper")
    :ensure t
    :bind (("C-`" . popper-toggle-latest) 
           ("M-`" . popper-cycle)
           ("C-M-`" . popper-toggle-type))
    :init
    (setq popper-reference-buffers
          '("\\*Messages\\*"
            "Output\\*$"
            "\\*Warnings\\*"
            "\\*Backtrace\\*"
            help-mode
            helpful-mode
            compilation-mode))
    (popper-mode +1)
    (popper-echo-mode +1)
    )


  (defvar rcool/help-temp-buffers '("^\\*Help\\*$",
                                    "^\\*helpful command"))

  (while rcool/help-temp-buffers
    (add-to-list 'display-buffer-alist
                 `(,(car rcool/help-temp-buffers)
                   (display-buffer-in-side-window
                    (side . left)
                    (window-width . 50))))

    (setq rcool/help-temp-buffers (cdr rcool/help-temp-buffers)))
#+end_src

** Key bindings with general
#+begin_src emacs-lisp  :tangle ~/.emacs.d/init.el
  (use-package general
    :ensure t
    :straight (general
 :fetcher github
 :repo "noctuid/general.el")
    :config
    (general-auto-unbind-keys)
    (general-evil-setup t))



  #+end_src

** Ace window
#+begin_src emacs-lisp :tangle ~/.emacs.d/init.el 
    (use-package ace-window 
    :straight (ace-window :repo "abo-abo/ace-window"
            :fetcher github)
    :defer t :ensure t)
#+end_src
** Diminish
#+begin_src emacs-lisp :tangle ~/.emacs.d/init.el 
    (use-package diminish 
:straight (diminish :fetcher github :repo "myrjola/diminish.el")
    :ensure t)
#+end_src
** Bufler 
#+begin_src emacs-lisp :tangle ~/.emacs.d/init.el 
    (use-package bufler
      :ensure t
      :straight (bufler :fetcher github :repo "alphapapa/bufler.el"
        :files (:defaults (:exclude "helm-bufler.el")))
      :config
      (setq bufler-filter-buffer-modes nil
           bufler-filter-buffer-name-regexps nil)
      (setf bufler-groups (bufler-defgroups
                           (group
                            ;; All named workspaces
                            (auto-workspace))
                           (group
                            ;; `help-mode' and `info-mode'
                            (group-or "*Help/Info*"
                                      (mode-match "*Help*" (rx bos "help-"))
                                      (mode-match "*Info*" (rx bos "info-"))))
                           (group
                            ;;special buffers (except magit)
                            (group-and "*Special*"
                                       (lambda (buffer)
                                         (unless (or (funcall (mode-match "Magit" (rx bos "magit-status"))
                                                              buffer)
                                                     (funcall (mode-match "Dired" (rx bos "dired"))
                                                              buffer)
                                                     (funcall (auto-file) buffer))
                                           "*Special*"))))
                           (group
                            ;;Special Special Buffers
                            (name-match "**Special**"
                                        (rx bos "*" (or "Messages" "Warnings" "scratch" "Backtrace") "*")))
                           (group
                            ;; All other Magic buffers by directory
                            (mode-match "Magit* (non-status)" (rx bos (or "magit" "forge") "-"))
                            (auto-directory))
                           ;; Remaining by directory then major mode
                           (auto-directory)
                           (auto-mode)))
      :general
      (:keymaps 'bufler-list-mode-map "Q" 'kill-this-buffer))
#+end_src

* Developer Interaction
This class of settings I think of as those that I need in order to work best with the editor.  How can I commicate. Plugins that affect how I communicate via keybindings, mouse, whatever should go here.
