emacs/emacs_config.org
**** Org-capture
#+begin_src emacs-lisp :tangle ~/.emacs.d/init.el 

(setq org-outline-path-complete-in-steps nil) ; Refile in a single go
(setq org-refile-use-outline-path t)          ; Show full paths for refiling

;; By default an org-capture/refile will save a bookmark. This
;; disables that and keeps my bookmark list how I want it.


(setq org-capture-templates
'(
        ("w" "Work Todo Entries")
        ("we" "No Time" entry (file "~/org/work.org")
         "** %^{Type|HW|READ|TODO|PROJ} %^{Todo title} %?" :prepend t :empty-lines-before 0
         :refile-targets (("~/org/work.org" :maxlevel . 2)))

        ("ws" "Scheduled" entry (file "~/org/work.org")
         "** %^{Type|HW|READ|TODO|PROJ} %^{Todo title}\nSCHEDULED: %^t%?" :prepend t :empty-lines-before 0
         :refile-targets (("~/org/work.org" :maxlevel . 2)))

        ("wd" "Deadline" entry (file "~/org/work.org")
         "** %^{Type|HW|READ|TODO|PROJ} %^{Todo title}\nDEADLINE: %^t%?" :prepend t :empty-lines-before 0
         :refile-targets (("~/org/work.org" :maxlevel . 2)))

        ("ww" "Scheduled & deadline" entry (file "~/org/work.org")
         "** %^{Type|HW|READ|TODO|PROJ} %^{Todo title}\nSCHEDULED: %^t DEADLINE: %^t %?" :prepend t :empty-lines-before 0
         :refile-targets (("~/org/work.org" :maxlevel . 2)))

)
))
#+end_src


*** OrgMode keybindings
#+begin_src emacs-lisp  :tangle ~/.emacs.d/init.el
   (general-def
     :states 'normal
     :keymaps 'org-mode-map
     "t" 'org-todo
     "<return>" 'org-open-at-point-global
     "K" 'org-shiftup
     "J" 'org-shiftdown
     "`" 'org-ctrl-c-ctrl-c)
   (general-def
     :states 'insert
     :keymaps 'org-mode-map
     "C-o" 'evil-org-open-above)

   (general-def
     :keymaps 'org-mode-map
     "M-[" 'org-metaleft
     "M-]" 'org-metaright
     "s-r" 'org-refile
     "M-k" 'org-insert-link
     )

   ;; Org src for editing a source block
   (general-def
     :prefix ","
     :states 'normal
     :keymaps 'org-src-mode-map

     "b" '(nil :which-key "org src")
     "bb" 'org-edit-src-exit
     "bc" 'org-edit-src-abort)
#+end_src
*** Org mode comma key setup
#+begin_src emacs-lisp  :tangle ~/.emacs.d/init.el
  (general-def
   :prefix ","
   :states 'motion
   :keymaps '(org-mode-map)
   "" nil
 
   "A" '(org-archive-subtree-default :which-key "org-archive")
   "a" '(org-agenda :which-key "org agenda")
   "6" '(org-sort :which-key "sort")
   "c" '(org-capture :which-key "org-capture")
   "s" '(org-schedule :which-key "schedule")
   "S" '(jib/org-schedule-tomorrow :which-key "schedule tmrw")
   "d" '(org-deadline :which-key "deadline")
   "g" '(consult-org-heading :which-key "goto heading")
   "t" '(org-tag :which-key "set tags")
   "p" '(org-set-property :which-key "set property")
   "r" '(jib/org-refile-this-file :which-key "refile in file")
   "e" '(org-export-dispatch :which-key "export org")
   "B" '(org-toggle-narrow-to-subtree :which-key "toggle narrow to subtree")
   "," '(jib/org-set-startup-visibility :which-key "startup visibility")
   "H" '(org-html-convert-region-to-html :which-key "convert region to html")
   "C" '(jib/org-copy-link-to-clipboard :which-key "copy link to clipboard")
   "1" '(org-toggle-link-display :which-key "toggle link display")
   "2" '(org-toggle-inline-images :which-key "toggle images")
   "3" '(jib/org-occur-unchecked-boxes :which-key "occur unchecked boxes")

   "b" '(nil :which-key "babel")
   "bt" '(org-babel-tangle :which-key "org-babel-tangle")
   "bb" '(org-edit-special :which-key "org-edit-special")
   "bc" '(org-edit-src-abort :which-key "org-edit-src-abort")
   "bk" '(org-babel-remove-result-one-or-many :which-key "org-babel-remove-result-one-or-many")


   ;; insert
   "i" '(nil :which-key "insert")


   "il" '(org-insert-link :which-key "org-insert-link")
   "l" '(org-insert-link :which-key "org-insert-link") ;; More convenient access
   "iL" '(org-link :which-key "org-link")
   "it" '(jb-hydra-org-table/body :which-key "tables")

   "is" '(nil :which-key "insert stamp")
   "iss" '((lambda () (interactive) (call-interactively (org-time-stamp-inactive))) :which-key "org-time-stamp-inactive")
   "isS" '((lambda () (interactive) (call-interactively (org-time-stamp nil))) :which-key "org-time-stamp")

   ;; clocking
   "c" '(nil :which-key "clocking")
   "ci" '(org-clock-in :which-key "clock in")
   "co" '(org-clock-out :which-key "clock out")
   "cj" '(org-clock-goto :which-key "jump to clock")
   )


  ;; Org-agenda
  (general-def
   :prefix ","
   :states 'motion
   :keymaps '(org-agenda-mode-map) ;; Available in org mode, org agenda
   "" nil
   "a" '(org-agenda :which-key "org agenda")
   "c" '(org-capture :which-key "org-capture")
   "s" '(org-agenda-schedule :which-key "schedule")
   "d" '(org-agenda-deadline :which-key "deadline")
   "t" '(org-agenda-set-tags :which-key "set tags")
   ;; clocking
   "c" '(nil :which-key "clocking")
   "ci" '(org-agenda-clock-in :which-key "clock in")
   "co" '(org-agenda-clock-out :which-key "clock out")
   "cj" '(org-clock-goto :which-key "jump to clock")
   )

  (evil-define-key 'motion org-agenda-mode-map
    (kbd "f") 'org-agenda-later
    (kbd "b") 'org-agenda-earlier)
#+end_src

#+RESULTS:

**** Evil org
#+begin_src emacs-lisp :tangle ~/.emacs.d/init.el 
  (fset 'evil-redirect-digit-argument 'ignore) ;; before evil-org loaded
    (use-package evil-org
      :ensure t
      :straight (evil-org :fetcher github :repo "Somelauw/evil-org-mode")
      :diminish evil-org-mode
      :after org
      :config
      (add-hook 'org-mode-hook 'evil-org-mode)
      (add-hook 'evil-org-mode-hook'
                (lambda () (evil-org-set-key-theme))))

    (require 'evil-org-agenda)
    (evil-org-agenda-set-keys)
#+end_src
** Auto  :tangle org files
#+begin_src emacs-lisp  :tangle ~/.emacs.d/init.el
   (use-package org-auto-tangle
     :ensure t
     :straight (org-auto-tangle :repo "yilkalargaw/org-auto-tangle" :fetcher github)
     :defer t
   :diminish
     :hook (org-mode . org-auto-tangle-mode)
     :config
     (setq org-auto-tangle-default t))
  #+end_src
** Org-projectile
#+begin_src emacs-lisp :tangle ~/.emacs.d/init.el 

     (use-package org-projectile
:straight (org-projectile :host github :repo "IvanMalison/org-projectile")
  :after org org-category-capture
       :config
       (progn
	 (setq org-projectile-projects-file
	       "~/org/projects.org"
	       org-projectile-capture-template
	       ("* TODO %?\n %i\n %a")
	       )
	 (add-to-list 'org-capture-templates
		      (org-projectile-project-todo-entry
		       :capture-character "l"
		       :capture-heading "Linked Project TODO"))
	 (add-to-list 'org-capture-templates
		      (org-projectile-project-todo-entry
		       :capture-character "p"))

	 (setq org-agenda-files (append org-agenda-files (org-projectile-todo-files)))
	 (push (org-projectile-project-todo-entry) org-capture-templates))
       :ensure t

       )

#+end_src

* Languages
**  Tree-sitter
#+begin_src emacs-lisp  :tangle ~/.emacs.d/init.el

  (use-package tree-sitter
    :ensure t
    :straight (tree-sitter :repo "emacs-tree-sitter/elisp-tree-sitter"
             :fetcher github
             :branch "release"
             :files (:defaults (:exclude "lisp/tree-sitter-tests.el")))
    :config
    (global-tree-sitter-mode)
    (add-hook 'tree-sitter-after-on-hook #'tree-sitter-hl-mode))

  (add-to-list 'tree-sitter-major-mode-language-alist '(tex-mode . tsx))
  (use-package tree-sitter-langs
  :straight (tree-sitter-langs :repo "emacs-tree-sitter/tree-sitter-langs"
                   :fetcher github
                   :branch "release"
                   :files (:defaults
                           "queries"))
    :ensure t
    :after tree-sitter)
  #+end_src

* LSP MODE
This seems like its the paved path, but I'm unsure.
#+begin_src emacs-lisp  :tangle ~/.emacs.d/init.el

    (use-package lsp-mode
    :ensure t
  :straight t 
    :commands (lsp lsp-deferred)
    :init
    (setq lsp-keymap-prefix "C-c l")
    (setq lsp-modeline-code-actions-segments t)
    :config
    (with-eval-after-load 'lsp-mode
      (add-hook 'lsp-mode-hook #'lsp-enable-which-key-integration)))


      (use-package lsp-ui
  :straight t
      :ensure t
      :hook ((lsp-mode . lsp-ui-mode)
  (lsp-mode . lsp-ui-sideline-mode))
      :config
  (setq lsp-ui-sideline-show-hover t)
    (setq lsp-ui-doc-position 'top))
#+end_src

#+RESULTS:
| lsp-ui-sideline-mode | lsp-ui-mode |

*** TEXmode
#+begin_src emacs-lisp  :tangle ~/.emacs.d/init.el
  (straight-use-package '(tsi :type git :host github :repo "orzechowskid/tsi.el"))
  (require 'tsi-css)
  (require 'tsi-json)
  (require 'tsi-typescript)
  (add-hook 'tsx-mode-hook (lambda () (tsi-typescript-mode 1)))
    (add-hook 'json-mode-hook (lambda () (tsi-json-mode 1)))
    (add-hook 'css-mode-hook (lambda () (tsi-css-mode 1)))
  (add-hook 'scss-mode-hook (lambda () (tsi-scss-mode 1)))

  (straight-use-package '(tsx-mode :type git :host github :repo "orzechowskid/tsx-mode.el" :branch "emacs29"))
  (add-to-list 'auto-mode-alist '("\\.[jt]sx\?\\'" . tsx-mode))
  (general-def
    :prefix ","
    :states 'motion
    :keymaps 'general-override-mode-map
    "" nil

    "z" '(tsx-mode-fold-toggle-all-nodes :which-key "Toggle Fold all nodes")
    "c" '(tsx-mode-coverage-toggle :which-key "Toggle Coverage")
    "tab" '(tsx-mode-fold-toggle-node :which-key "Toggle Fold here")
   )
  (add-hook 'tsx-mode #'lsp-deferred)
#+END_SRC

#+RESULTS:


#+begin_src emacs-lisp :tangle yes


      (use-package coverlay
	:ensure t
	:straight '(coverlay :type git
			     :host github :repo "twada/coverlay.el"))
#+end_src

#+RESULTS:

#+begin_src emacs-lisp :tangle yes


(use-package css-in-js-mode
  
	:ensure t :straight '(css-in-js-mode :type git :host github :repo "orzechowskid/tree-sitter-css-in-js"))
      (use-package origami :ensure t
	:straight '(origamd
		    :type git
		    :host github
		    :repo "gregsexton/origami.el"))

#+end_src

#+RESULTS:

#+begin_src emacs-lisp :tangle yes

  (use-package corfu
    :ensure t
    :straight (corfu :host github :repo "minad/corfu")
   :custom
   (corfu-cycle t)                ;; Enable cycling for `corfu-next/previous'
  ;; (corfu-auto t)                 ;; Enable auto completion
   (corfu-separator ?\s)          ;; Orderless field separator
  ;; (corfu-quit-at-boundary nil)   ;; Never quit at completion boundary
   (corfu-quit-no-match nil)      ;; Never quit, even if there is no match
   (corfu-preview-current t)    ;; Disable current candidate preview
   (corfu-preselect 'prompt)      ;; Preselect the prompt
  ;; (corfu-on-exact-match nil)     ;; Configure handling of exact matches
  ;; (corfu-scroll-margin 5)        ;; Use scroll margin

  ;; Enable Corfu only for certain modes.
   :hook ((prog-mode . corfu-mode)
	  (shell-mode . corfu-mode)
	  (eshell-mode . corfu-mode))

  ;; Recommended: Enable Corfu globally.
  ;; This is recommended since Dabbrev can be used globally (M-/).
  ;; See also `corfu-excluded-modes'.
  :init
  (global-corfu-mode))

#+end_src

#+RESULTS:
| corfu-mode |

#+begin_src emacs-lisp :tangle yes

    ;; A few more useful configurations...
    (use-package emacs
      :init
      ;; TAB cycle if there are only few candidates
      (setq completion-cycle-threshold 3)

      ;; Emacs 28: Hide commands in M-x which do not apply to the current mode.
      ;; Corfu commands are hidden, since they are not supposed to be used via M-x.
      ;; (setq read-extended-command-predicate
      ;;       #'command-completion-default-include-p)

      ;; Enable indentation+completion using the TAB key.
      ;; `completion-at-point' is often bound to M-TAB.
      (setq tab-always-indent 'complete))
#+end_src

#+RESULTS:
                                       
*** Formatting on Save
We use =apheleia= to handle our formatting. This packages can do many different languages so including it here will
benefit others as well.

#+begin_src emacs-lisp  :tangle ~/.emacs.d/init.el
  (use-package apheleia
    :ensure t
  :diminish
  :straight '(apheleia :type git :host github :repo "raxod502/apheleia")
    :config
    (apheleia-global-mode +1))
 #+end_src

 #+RESULTS:
 : t

** Simple Lua
*** Enable =lua-mode=

#+begin_src emacs-lisp  :tangle ~/.emacs.d/init.el :results none 
  (use-package lua-mode
    :straight (lua-mode :repo "immerrr/lua-mode" :fetcher github)
    :ensure t
    :after (tree-sitter lsp)
    :hook (lua-mode . lsp-deferred)
    :init
    (add-to-list 'auto-mode-alist '("\\.lua\\'" . lua-mode))
    (add-to-list 'interpreter-mode-alist '("lua" . lua-mode))
    )
#+END_SRC

* Completion
