emacs/emacs_config.org
** Consult
#+begin_src emacs-lisp :tangle ~/.emacs.d/init.el
  ;; Example configuration for Consult
  (use-package consult
  :straight (consult :type git :host github :repo "minad/consult")
    ;; Replace bindings. Lazily loaded due by `use-package'.
    :bind (;; C-c bindings (mode-specific-map)
	   ("C-c h" . consult-history)
	   ("C-c m" . consult-mode-command)
	   ("C-c k" . consult-kmacro)
	   ;; C-x bindings (ctl-x-map)
	   ("C-x M-:" . consult-complex-command)     ;; orig. repeat-complex-command
	   ("C-x b" . consult-buffer)                ;; orig. switch-to-buffer
	   ("C-x 4 b" . consult-buffer-other-window) ;; orig. switch-to-buffer-other-window
	   ("C-x 5 b" . consult-buffer-other-frame)  ;; orig. switch-to-buffer-other-frame
	   ("C-x r b" . consult-bookmark)            ;; orig. bookmark-jump
	   ("C-x p b" . consult-project-buffer)      ;; orig. project-switch-to-buffer
	   ;; Custom M-# bindings for fast register access
	   ("M-#" . consult-register-load)
	   ("M-'" . consult-register-store)          ;; orig. abbrev-prefix-mark (unrelated)
	   ("C-M-#" . consult-register)
	   ;; Other custom bindings
	   ("M-y" . consult-yank-pop)                ;; orig. yank-pop
	   ;; M-g bindings (goto-map)
	   ("M-g e" . consult-compile-error)
	   ("M-g f" . consult-flymake)               ;; Alternative: consult-flycheck
	   ("M-g g" . consult-goto-line)             ;; orig. goto-line
	   ("M-g M-g" . consult-goto-line)           ;; orig. goto-line
	   ("M-g o" . consult-outline)               ;; Alternative: consult-org-heading
	   ("M-g m" . consult-mark)
	   ("M-g k" . consult-global-mark)
	   ("M-g i" . consult-imenu)
	   ("M-g I" . consult-imenu-multi)
	   ;; M-s bindings (search-map)
	   ("M-s d" . consult-find)
	   ("M-s D" . consult-locate)
	   ("M-s g" . consult-grep)
	   ("M-s G" . consult-git-grep)
	   ("M-s r" . consult-ripgrep)
	   ("M-s l" . consult-line)
	   ("M-s L" . consult-line-multi)
	   ("M-s k" . consult-keep-lines)
	   ("M-s u" . consult-focus-lines)
	   ;; Isearch integration
	   ("M-s e" . consult-isearch-history)
	   :map isearch-mode-map
	   ("M-e" . consult-isearch-history)         ;; orig. isearch-edit-string
	   ("M-s e" . consult-isearch-history)       ;; orig. isearch-edit-string
	   ("M-s l" . consult-line)                  ;; needed by consult-line to detect isearch
	   ("M-s L" . consult-line-multi)            ;; needed by consult-line to detect isearch
	   ;; Minibuffer history
	   :map minibuffer-local-map
	   ("M-s" . consult-history)                 ;; orig. next-matching-history-element
	   ("M-r" . consult-history))                ;; orig. previous-matching-history-element

    ;; Enable automatic preview at point in the *Completions* buffer. This is
    ;; relevant when you use the default completion UI.
    :hook (completion-list-mode . consult-preview-at-point-mode)

    ;; The :init configuration is always executed (Not lazy)
    :init

    ;; Optionally configure the register formatting. This improves the register
    ;; preview for `consult-register', `consult-register-load',
    ;; `consult-register-store' and the Emacs built-ins.
    (setq register-preview-delay 0.5
	  register-preview-function #'consult-register-format)

    ;; Optionally tweak the register preview window.
    ;; This adds thin lines, sorting and hides the mode line of the window.
    (advice-add #'register-preview :override #'consult-register-window)

    ;; Use Consult to select xref locations with preview
    (setq xref-show-xrefs-function #'consult-xref
	  xref-show-definitions-function #'consult-xref)

    ;; Configure other variables and modes in the :config section,
    ;; after lazily loading the package.
    :config

    ;; Optionally configure preview. The default value
    ;; is 'any, such that any key triggers the preview.
    ;; (setq consult-preview-key 'any)
    ;; (setq consult-preview-key (kbd "M-."))
    ;; (setq consult-preview-key (list (kbd "<S-down>") (kbd "<S-up>")))
    ;; For some commands and buffer sources it is useful to configure the
    ;; :preview-key on a per-command basis using the `consult-customize' macro.
    (consult-customize
     consult-theme :preview-key '(:debounce 0.2 any)
     consult-ripgrep consult-git-grep consult-grep
     consult-bookmark consult-recent-file consult-xref
     consult--source-bookmark consult--source-file-register
     consult--source-recent-file consult--source-project-recent-file
     ;; :preview-key (kbd "M-.")
     :preview-key '(:debounce 0.4 any))

    ;; Optionally configure the narrowing key.
    ;; Both < and C-+ work reasonably well.
    (setq consult-narrow-key "<") ;; (kbd "C-+")

    ;; Optionally make narrowing help available in the minibuffer.
    ;; You may want to use `embark-prefix-help-command' or which-key instead.
    ;; (define-key consult-narrow-map (vconcat consult-narrow-key "?") #'consult-narrow-help)

    ;; By default `consult-project-function' uses `project-root' from project.el.
    ;; Optionally configure a different project root function.
    ;; There are multiple reasonable alternatives to chose from.
    ;;;; 1. project.el (the default)
    ;; (setq consult-project-function #'consult--default-project--function)
    ;;;; 2. projectile.el (projectile-project-root)
     (autoload 'projectile-project-root "projectile")
     (setq consult-project-function (lambda (_) (projectile-project-root)))
    ;;;; 3. vc.el (vc-root-dir)
    ;; (setq consult-project-function (lambda (_) (vc-root-dir)))
    ;;;; 4. locate-dominating-file
    ;; (setq consult-project-function (lambda (_) (locate-dominating-file "." ".git"))))
     )
#+end_src

#+RESULTS:
: consult-history

** Consult-dir
#+begin_src emacs-lisp :tangle ~/.emacs.d/init.el 
  (use-package consult-dir
    :ensure t
  :straight (consult-dir :host github :repo "karthink/consult-dir")
    :bind (("C-x C-d" . consult-dir)
           :map vertico-map
           ("C-x C-d" . consult-dir)
           ("C-x C-j" . consult-dir-jump-file)))
#+end_src

#+RESULTS:

** Consult-flycheck
#+begin_src emacs-lisp :tangle ~/.emacs.d/init.el 

          (use-package consult-flycheck
          :ensure t
        :straight (
  consult-flycheck
    :host github
  :repo
  "minad/consult-flycheck"
    ))
#+end_src

#+RESULTS:

* Consult-eglot
#+begin_src emacs-lisp :tangle ~/.emacs.d/init.el 
     (use-package consult-lsp :ensure t :straight t)
#+end_src

#+RESULTS:

** Consult-projectile
#+begin_src emacs-lisp :tangle ~/.emacs.d/init.el 
         (use-package consult-projectile :ensure t
        :straight
       (consult-projectile
      :type git :host gitlab
    :repo "OlMon/consult-projectile"
  :branch "master"))


#+end_src

#+RESULTS:

** Consult-yasnippet
#+begin_src emacs-lisp :tangle ~/.emacs.d/init.el 
	(use-package consult-yasnippet
	:ensure t
  :straight (consult-yasnippet :host github
    :repo "mohkale/consult-yasnippet")
    )
#+end_src

#+RESULTS:

** wgrep
#+begin_src emacs-lisp :tangle ~/.emacs.d/init.el 
(use-package wgrep :ensure t :straight (wgrep
 :fetcher github
 :repo "mhayashi1120/Emacs-wgrep"
 :files ("wgrep.el")))
#+end_src

#+RESULTS:


** Veritco
#+begin_src emacs-lisp :tangle ~/.emacs.d/init.el 
    ;; Enable vertico
    (use-package vertico
      :ensure t
  :straight (vertico :host github :repo "minad/vertico"  :files (:defaults "extensions/*")
                         :includes (vertico-buffer
                                    vertico-directory
                                    vertico-flat
                                    vertico-indexed
                                    vertico-mouse
                                    vertico-quick
                                    vertico-repeat
                                    vertico-reverse)))
      :init
      (vertico-mode)

      ;; Different scroll margin
      ;; (setq vertico-scroll-margin 0)

      ;; Show more candidates
      ;; (setq vertico-count 20)

      ;; Grow and shrink the Vertico minibuffer
      ;; (setq vertico-resize t)

      ;; Optionally enable cycling for `vertico-next' and `vertico-previous'.
      ;; (setq vertico-cycle t)
      

    ;; Persist history over Emacs restarts. Vertico sorts by history position.
    (use-package savehist
      :ensure t
      :init
      (savehist-mode))

    ;; A few more useful configurations...
    (use-package emacs
      :init
      ;; Add prompt indicator to `completing-read-multiple'.
      ;; We display [CRM<separator>], e.g., [CRM,] if the separator is a comma.
      (defun crm-indicator (args)
	(cons (format "[CRM%s] %s"
		      (replace-regexp-in-string
		       "\\`\\[.*?]\\*\\|\\[.*?]\\*\\'" ""
		       crm-separator)
		      (car args))
	      (cdr args)))
      (advice-add #'completing-read-multiple :filter-args #'crm-indicator)

    ;; Do not allow the cursor in the minibuffer prompt
    (setq minibuffer-prompt-properties
	  '(read-only t cursor-intangible t face minibuffer-prompt))
    (add-hook 'minibuffer-setup-hook #'cursor-intangible-mode)

    ;; Emacs 28: Hide commands in M-x which do not work in the current mode.
      ;; Vertico commands are hidden in normal buffers.
      ;; (setq read-extended-command-predicate
      ;;       #'command-completion-default-include-p)

      ;; Enable recursive minibuffers
      (setq enable-recursive-minibuffers t))
#+end_src

#+RESULTS:

** vertico directory
#+begin_src emacs-lisp :tangle ~/.emacs.d/init.el 
;; Configure directory extension.
(use-package vertico-directory  :after vertico
  :ensure nil
  ;; More convenient directory navigation commands
  :bind (:map vertico-map
              ("RET" . vertico-directory-enter)
              ("DEL" . vertico-directory-delete-char)
              ("M-DEL" . vertico-directory-delete-word))
  ;; Tidy shadowed file names
  :hook (rfn-eshadow-update-overlay . vertico-directory-tidy))

#+end_src

#+RESULTS:
: vertico-directory-delete-word

** Orderless
#+begin_src emacs-lisp :tangle ~/.emacs.d/init.el 
(use-package orderless :ensure t
:straight (orderless :host github :repo "oantolin/orderless") 
  :init
  ;; Configure a custom style dispatcher (see the Consult wiki)
  ;; (setq orderless-style-dispatchers '(+orderless-dispatch)
  ;;       orderless-component-separator #'orderless-escapable-split-on-space)
  (setq completion-styles '(substring orderless basic)
        completion-category-defaults nil
        completion-category-overrides '((file (styles partial-completion)))))
#+end_src

#+RESULTS:

** Vertico quick
#+begin_src emacs-lisp :tangle ~/.emacs.d/init.el 
(use-package vertico-quick :ensure nil)
#+end_src

#+RESULTS:

** Embark
#+begin_src emacs-lisp :tangle ~/.emacs.d/init.el 
    (use-package embark
    :straight (embark :host github :repo "oantolin/embark")
      :ensure t

      :bind
      (("C-." . embark-act)         ;; pick some comfortable binding
       ("C-;" . embark-dwim)        ;; good alternative: M-.
       ("C-h B" . embark-bindings)) ;; alternative for `describe-bindings'

      :init

      ;; Optionally replace the key help with a completing-read interface
      (setq prefix-help-command #'embark-prefix-help-command)

      :config

      ;; Hide the mode line of the Embark live/completions buffers
      (add-to-list 'display-buffer-alist
                   '("\\`\\*Embark Collect \\(Live\\|Completions\\)\\*"
                     nil
                     (window-parameters (mode-line-format . none)))))

    ;; Consult users will also want the embark-consult package.
    (use-package embark-consult
    :straight (embark-consult :host github :repo "oantolin/embark")
      :ensure t ; only need to install it, embark loads it after consult if found
      :hook
      (embark-collect-mode . consult-preview-at-point-mode))
#+end_src

#+RESULTS:
| consult-preview-at-point-mode |



** Treemacs
#+begin_src emacs-lisp  :tangle ~/.emacs.d/init.el
    (use-package treemacs
    :straight (treemacs :host github :repo "Alexander-Miller/treemacs" :branch "master")
      :ensure t
      :defer t
      :config
      (setq treemacs-position 'right
	    width 50))

    (use-package lsp-treemacs
    :ensure t
    :straight t
  :after lsp)
#+end_src


#+RESULTS:


*** Treemacs-evil
#+begin_src emacs-lisp  :tangle ~/.emacs.d/init.el
  (use-package treemacs-evil
  :straight (treemacs-evil :host github :repo "Alexander-Miller/treemacs" :branch "master")
    :ensure t
    :config
    )

#+end_src

#+RESULTS:


*** Treemacs-projectile
#+begin_src emacs-lisp  :tangle ~/.emacs.d/init.el
  (use-package treemacs-projectile
  :straight (treemacs-projectile :host github :repo "Alexander-Miller/treemacs" :branch "master")
    :ensure t
    )

#+end_src

#+RESULTS:



*** treemacs-magit
#+begin_src emacs-lisp  :tangle ~/.emacs.d/init.el
  (use-package treemacs-magit
  :straight (treemacs-magit :host github :repo "Alexander-Miller/treemacs" :branch "master")

    :ensure t
    )

#+end_src

#+RESULTS:


*** treemacs-icons-dired
#+begin_src emacs-lisp :tangle ~/.emacs.d/init.el 
(use-package treemacs-icons-dired :ensure t 
:straight (treemacs-icons-dired :host github :repo "Alexander-Miller/treemacs" :branch "master")
  :hook (dired-mode . treemacs-icons-dired-mode))
#+end_src

#+RESULTS:
| treemacs-icons-dired-mode |


*** treemacs-perspective
#+begin_src emacs-lisp :tangle ~/.emacs.d/init.el 
(use-package treemacs-perspective :ensure t
:straight (treemacs-perspective :host github :repo "Alexander-Miller/treemacs" :branch "master")
  :config
  (treemacs-set-scope-type 'Perspectives))
#+end_src

#+RESULTS:
: t


*** treemacs-all-the-icons
#+begin_src emacs-lisp :tangle ~/.emacs.d/init.el 
(use-package treemacs-all-the-icons :ensure t 
:straight (treemacs-all-the-icons :host github :repo "Alexander-Miller/treemacs" :branch "master")
  :config
  (treemacs-load-theme "all-the-icons"))
#+end_src

#+RESULTS:
: t


** Prescient
#+begin_src emacs-lisp :tangle ~/.emacs.d/init.el 
        (use-package prescient
        :straight t
          :ensure t)
      (use-package vertico-prescient :ensure t :straight t
      :config
(vertico-prescient-mode +1)
  )
#+end_src

#+RESULTS:


* Magit

#+begin_src emacs-lisp  :tangle ~/.emacs.d/init.el
    (use-package magit
    :straight t
    :ensure t
    :commands (magit-status magit-get-current-branch)
    :custom
    (magit-display-buffer-function #'magit-display-buffer-same-window-except-diff-v1))

  #+end_src

  #+RESULTS:


* Editing Configuration
** Tab Widths
Default to an indentation size of 2
#+begin_src emacs-lisp  :tangle ~/.emacs.d/init.el
(setq-default tab-width 2)
(setq-default evil-shift-width tab-width)
#+end_src

#+RESULTS:
: 2

** Spaces not tabs
#+begin_src emacs-lisp  :tangle ~/.emacs.d/init.el
  (setq-default indent-tabs-mode nil)
#+end_src

#+RESULTS:

** Comments:
#+begin_src emacs-lisp  :tangle ~/.emacs.d/init.el
  (use-package evil-nerd-commenter
  :straight (evil-nerd-commenter :host github :repo "redguardtoo/evil-nerd-commenter")
    :ensure t
    :bind
    ("M-/" . evilnc-comment-or-uncomment-lines))

#+end_src

#+RESULTS:
: evilnc-comment-or-uncomment-lines


#+RESULTS:

* Hydra
** Fonts
#+begin_src emacs-lisp :tangle ~/.emacs.d/init.el 
  (defhydra rc-hydra-variable-fonts (:pre (mixed-pitch-mode 0)
                                          :post (mixed-pitch-mode 1))
    ("t" (set-face-attribute 'variable-pitch nil :family "Tinos" :height 160)             "Tinos")
    ("g" (set-face-attribute 'variable-pitch nil :family "EB Garamond" :height 160 :weight 'normal)             "EB Garamond")
    ("n" (set-face-attribute 'variable-pitch nil :family "Nunito" :slant 'normal :weight 'normal :height 160) "Nunito")
    ("s" (set-face-attribute 'variable-pitch nil :family "Spleen 32x64" :slant 'normal :weight 'normal :height 160) "Spleen")
    ("c" (set-face-attribute 'variable-pitch nil :family "Source Sans Pro" :slant 'normal :weight 'normal :height 160) "Source Sans Pro")
  )
#+end_src

#+RESULTS:
: rc-hydra-variable-fonts/body
