emacs/emacs_config.org
** Code folding
#+begin_src emacs-lisp :tangle ~/.emacs.d/init.el :results none
(global-set-key
 (kbd "H-C-f")
 (defhydra hydra-folding (:color red)
   "
  _o_pen node    _n_ext fold       toggle _f_orward  _s_how current only
  _c_lose node   _p_revious fold   toggle _a_ll
  "
   ("o" origami-open-node)
   ("c" origami-close-node)
   ("n" origami-next-fold)
   ("p" origami-previous-fold)
   ("f" origami-forward-toggle-node)
   ("a" origami-toggle-all-nodes)
   ("s" origami-show-only-node)))
#+end_src


* Keybinds
** Preamble
#+begin_src emacs-lisp  :tangle ~/.emacs.d/init.el
(general-def
   :states '(normal motion visual)
   :keymaps 'override
   :prefix "SPC"

   ;; Top level functions
   "/" '(rc/rg :which-key "RipGrep")
   "SPC" '(M-x :which-key "M-x")
   "q" '(popper-kill-latest-popup :which-key "kill popup")
   "X" '(org-capture :which-key "Capture")
#+END_SRC
** Files
#+begin_src emacs-lisp :tangle ~/.emacs.d/init.el 
  "f" '(nil :which-key "Files")
  "fd" '(ido-dired :which-key "Find directory")
  "ff" '(ido-find-file :which-key "Find file")
  "fr" '(recentf-open-files :which-key "Recent Files")
  "fs" '(save :which-key "Save")

#+end_src

#+RESULTS:
| save | :which-key | Save |


** Buffers
#+BEGIN_SRC emacs-lisp  :tangle ~/.emacs.d/init.el
    ;; Buffers
    "b" '(nil :which-key "Buffer")
    "bb" '(consult-project-buffer :which-key "Switch (proj) buffer")
    "bB" '(bufler-switch-buffer :which-key "Switch any buffer")
    "bd" '(evil-delete-buffer :which-key "Delete buffer")
    "bm" '(rc/kill-other-buffers :which-key "Kill other buffers")
    "bi" '(ibuffer :which-key "iBuffer")
    "br" '(revert-buffer :which-key "Revert buffer")
    "bn" '(next-buffer :which-key "Next")
    "bp" '(previous-buffer :which-key "Prev")


#+END_SRC

#+RESULTS:
| previous-buffer | :which-key | Prev |

** Code
#+BEGIN_SRC emacs-lisp  :tangle ~/.emacs.d/init.el
  ;; lCode

  "c" '(nil :which-key "Code")
  "cd" '(xref-find-definition :which-key "Definition")
  "cR" '(xref-find-references :which-key "References")
  "ca" '(lsp-execute-code-actions :which-key "Code action")
  "ci" '(lsp-ui-peek-find-implementation :which-key "Implementations")
  "cD" '(lsp-ui-peek-findre-type-definition :which-key "Type Def.")
  "cr" '(lsp-rename :which-key "Rename Symbol")



  "ce" '(nil :which-key "Errors")
  "cek" '(flycheck-previous-error :which-key "Prev Error")
  "cej" '(flycheck-next-error :which-key "Next Error")
  "ceg" '(flycheck-first-error :which-key "First Error")
  "cef" '(flycheck-error-list-set-filter :which-key "Filter")
  "ceG" '((progn (goto-char (point-max)) (flycheck-previour-error)) :which-key "Last Error")
  "cel" '(consult-flycheck :which-key "Error List")
  "cee" '(flycheck-explain-error-at-point :which-key "Explain error")

  "cf" '(nil :which-key "Format")
  "cfl" '(lsp-format-buffer :which-key "LSP format Buffer")
  "cfa" '(apheleia-format-buffer :which-key "Apheleia Format")
  "cfr" '(lsp-format-region :which-key "LSP Format Region")
#+END_SRC

** Bookmarks
#+begin_src emacs-lisp :tangle ~/.emacs.d/init.el 
  "m" '(nil :which-key "Bookmarks")
  "ma" '(bookmark-set  :which-key "Set a bookmark")
  "mj" '(bookmark-jump-other-window :which-key "Jump to bookmark")
  "mJ" '(bookmark-jump :which-key "Jump Here")
  "mb" '(consult-bookmark :which-key "Set or Jump")
  
#+end_src


** Projects
#+begin_src emacs-lisp :tangle ~/.emacs.d/init.el 
  "p" '(nil :which-key "Projects")
  "pp" '(consult-projectile-switch-project :which-key "Switch Project")
  "pg" '(consult-rg :which-key "RipGrep")
  "pf" '(consult-projectile-find-file :which-key "find file")
  "pr" '(consult-projectile-recentf :which-key "recent files")
  "pb" '(consult-projectile-switch-to-buffer :which-key "buffers")

  
#+END_SRC

#+RESULTS:
| consult-projectile-buffer | :which-key | buffers |

** Hydra
#+BEGIN_SRC emacs-lisp  :tangle ~/.emacs.d/init.el
  ;; Hydras
  "H" '(nil :which-key "Hydras")
  "Ht" '(rc-hydra-theme-switcher/body :which-key "themes")
  "Hf" '(rc-hydra-variable-fonts/body :which-key "mixed-pitch face")
  "Hw" '(rc-hydra-window/body :which-key "Window Control")
  "Hd" '(hydra-dired/body :which-key "Dired")
  "He" '(hydra-flycheck/body :which-key "Diagnostics")
  "Ho" '(hydra-org-agenda/body :which-key "Org Agenda")
  "Ha" '(hydra-avy/body :which-key "Avy")
  "Hy" '(hydra-yasnippet/body :which-key "YASnippet")
  "Hz" '(hydra-folding/body :which-key "Folding")
  "Hl" '(hydra-lsp/body :which-key "LSP")
  "Hb" '(my/switch-to-buffer/body :which-key "Switch to Buffer")
  "HD" '(hydra-dap :which-key "DAP")
  
#+END_SRC

#+RESULTS:
| dap-hydra/body | :which-key | DAP |

** Help
#+BEGIN_SRC emacs-lisp  :tangle ~/.emacs.d/init.el
    ;; Help/emacs
    "h" '(nil :which-key "help/emacs")

    "hv" '(helpful-variable :which-key "des. variable")
    "hb" '(describe-bindings :which-key "des. bindings")
    "hM" '(describe-mode :which-key "des. mode")
    "hf" '(helpful-function :which-key "des. func")
    "hF" '(describe-face :which-key "des. face")
    "hk" '(helpful-key :which-key "des. key")
  
    "hed" '((lambda () (interactive) (jump-to-register 67)) :which-key "edit dotfile")

    "hm" '(nil :which-key "switch mode")
    "hme" '(elisp-mode :which-key "elisp mode")
    "hmo" '(org-mode :which-key "org mode")
    "hmt" '(text-mode :which-key "text mode")

    "hp" '(nil :which-key "packages")
    "hpr" 'package-refresh-contents
    "hpi" 'package-install
    "hpd" 'package-delete

#+END_SRC

** Debug
#+begin_src emacs-lisp :tangle ~/.emacs.d/init.el :results none
  "D" '(nil :which-key "Debug")
  "Db" '(dap-breakpoint-toggle :which-key "Toggle BP")
  "DD" '(dap-breakpoint-delete :which-key "Delete BP")
  "DA" '(dap-breakpoint-add :which-key "Add BP")
  "D+" '(dap-step-in :which-key "Step In")
  "D>" '(dap-next :which-key "Next")
  "D-" '(dap-step-out :which-key "Step out")
  "D'" '(dap-continue :which-key "continue")
  "De" '(dap-debug-edit-template :which-key "Edit current template")
  "Dn" '(dap-debug :which-key "Create and run a new dap config")
  "Dl" '(dap-debug-last :which-key "Debug using the last template you used")
  "Dr" '(dap-debug-recent :which-key "debug w/ recent template")
            "Do" '(dap-go-to-output-buffer :which-key "Output")              
  


#+end_src

** Window
#+BEGIN_SRC emacs-lisp  :tangle ~/.emacs.d/init.el

  ;; Windows
         "w" '(nil :which-key "window")
         "wm" '(rc/toggle-maximize-buffer :which-key "maximize buffer")
         "wN" '(make-frame :which-key "make frame")
         "wd" '(evil-window-delete :which-key "delete window")
         "ws" '(rc/split-window-vertically-and-switch :which-key "split below")
         "wv" '(rc/split-window-horizontally-and-switch :which-key "split right")
         "wr" '(rc-hydra-window/body :which-key "hydra window")
         "wl" '(evil-window-right :which-key "evil-window-right")
         "wh" '(evil-window-left :which-key "evil-window-left")
         "wj" '(evil-window-down :which-key "evil-window-down")
         "wk" '(evil-window-up :which-key "evil-window-up")
  "wz" '(text-scale-adjust :which-key "text zoom")
  "wu" '(winner-undo :which-key "Winnder undo")
  "wU" '(winner-redo :which-key "Winner Redo")
#+END_SRC
** Registers
#+begin_src emacs-lisp :tangle ~/.emacs.d/init.el 
  "r" '(nil :which-key "Registers")
  "rc" '(copy-to-register :which-key "Copy to Register")
  "rf" '(frameset-to-register :which-key "Frameset to register")
  "ri" '(insert-register :which-key "Insert contents of register")
  "rj" '(jump-to-register :which-key "Jump to")
  "rl" '(list-registers :which-key "List registers")
  "rn" '(number-to-register :which-key "Number to register")
  "rr" '(consult-register :which-key "Choose a register")
  "rv" '(view-register :which-key "View register")
  "rw" '(window-configuration-to-register :which-key "Window config to register")
  "r+" '(increment-register :which-key "Increment register")
  "r " '(point-to-register :which-key "Point to Register")
  "rs" '(consult-register-store :which-key "Store")
#+end_src
** Workspaces
#+begin_src emacs-lisp :tangle ~/.emacs.d/init.el 
  "s" '(nil :which-key "Work[s]paces")
  "ss" '(persp-switch :which-key "Switch")
  "sn" '(persp-switch-by-number :which-key "Swich By #")
  "sk" '(persp-remove-buffer :which-key "Remove Buffer")
  "sd" '(persp-kill :which-key "Delete workspace")
  "sr" '(persp-rename :which-key "Rename")
  "sa" '(persp-add-buffer :which-key "Add a buffer")
  "sc" '(persp-set-buffer :which-key "Claim buffer for perspective")
  "sb" '(persp-switch-to-buffer :which-key "Switch to buffer (in any perspective)")
  "sS" '(persp-state-save :which-key "Save")
  "sL" '(persp-state-load :which-key "Load")
#+end_src


** DONE Toggles
CLOSED: [2022-12-30 Fri 03:49]
#+BEGIN_SRC emacs-lisp  :tangle ~/.emacs.d/init.el
  ;; Toggles
  "t" '(nil :which-key "toggles")
  "tm" '(modus-themes-toggle :which-key "Modus Themes")
  "ta" '(term-toggle-ansi :which-key "Ansi Term")
  "tA" '(ansi-term :which-key "Ansi Term (HERE)")
  "tt" '(term-toggle-term :which-key "Term")
  "tT" '(term :which-key "Term (HERE)")
  "te" '(term-toggle-eshell :which-key "Eshell")
  "tE" '(eshell :which-key "Eshell (HERE)")
  "td" '(dired-single :which-key "Dired")
  "tp" '(treemacs :which-key "Treemacs")
  "to" '(function :which-key "description")
  )
#+end_src


** DONE Global keybinds
CLOSED: [2022-12-29 Thu 06:28]
#+begin_src emacs-lisp  :tangle ~/.emacs.d/init.el
  
  (general-def
    :keymaps 'override
    :states '(normal motion)
    "K" 'eldoc
    "Q" 'popper-kill-latest-popup
  )
#+end_src


** Non-insert mode bindings
#+begin_src emacs-lisp  :tangle ~/.emacs.d/init.el
  (general-def
    :states '(normal visual motion)
    "gc" 'comment-dwim
    "gC" 'comment-line
    "u" 'undo-fu-only-undo
    "U" 'undo-fu-only-redo
    "j" 'evil-next-visual-line
    "k" 'evil-previous-visual-line
    "f" 'evil-avy-goto-char-in-line
    )

  (general-def
    :states '(normal visual motion)
    :keymaps 'override
    "s" 'swiper)

  (general-def
    :states '(insert)
    "C-a" 'evil-beginning-of-visual-line
    "C-e" 'evil-end-of-visual-line
    "C-S-a" 'evil-beginning-of-line
    "C-S-e" 'evil-end-of-line
    "C-n" 'evil-next-visual-line
    "C-p" 'evil-previous-visual-line
    "TAB" 'yas-expand 

    )
#+end_src
* Languages
** emacs-lisp-mode
#+begin_src emacs-lisp :tangle ~/.emacs.d/init.el 
  (use-package emacs-lisp-mode
    :ensure nil
    :general
    (general-def
     :prefix ","
     :states 'motion
     :keymaps 'emacs-lisp-mode-map
     "" nil
     "e" '(nil :which-key "eval")
     "es" '(eval-last-sexp :which-key "eval-sexp")
     "er" '(eval-region :which-key "eval-region")
     "eb" '(eval-buffer :which-key "eval-buffer")

     "g" '(consult-imenu :which-key "imenu")
     "c" '(check-parens :which-key "check parens")
     "I" '(indent-region :which-key "indent-region")
     "b" '(nil :which-key "org src")
     "bc" '(org-edit-src-abort :which-key "Abort")
     "bb" '(org-edit-src-exit :which-key "Save & Exit")
     )


    )
#+end_src

#+RESULTS:


* Dashboard
#+begin_src emacs-lisp :tangle ~/.emacs.d/init.el 
  (use-package dashboard
  :straight (dashboard :fetcher github
	   :repo "emacs-dashboard/emacs-dashboard"
	   :files (:defaults "banners"))
    :ensure t
    :config
    (dashboard-setup-startup-hook))
  (setq dashboard-banner-logo-title "")
  (setq dashboard-startup-banner "~/.emacs.d/ka.png")

  (setq initial-buffer-choice (lambda () (get-buffer-create "*dashboard*"))    )

  #+end_src

  #+RESULTS:
  | lambda | nil | (get-buffer-create *dashboard*) |

* kill the scratch on startup
#+begin_src emacs-lisp :tangle ~/.emacs.d/init.el 
(add-hook 'emacs-startup-hook (lambda ()
                                (when (get-buffer "*scratch*")
                                  (kill-buffer "*scratch*"))))
#+end_src

#+RESULTS:
| lambda | nil | (when (get-buffer *scratch*) (kill-buffer *scratch*))                                         |
| lambda | nil | (message Emacs ready in %s with %d garbage collections. (format %.2f seconds (float-time (time-subtract after-init-time before-init-time))) gcs-done) |
| lambda | nil | (setq gc-cons-percentage 0.1)                                                                 |


* Adding python support

First we need to add the lsp server to our local environment.  We use `pyls` for this.
#+begin_src sh
  pip install --user "python-language-server[all]"
#+end_src
*Note:* There are many language servers for python. If this one doesn't work out, checkout the `lsp-mode`
[[http://emacs.lsp.github.io/lsp-mode/page/languages/][documentation]] to try some others.

Setup with `use-package`:
#+begin_src emacs-lisp :tangle ~/.emacs.d/init.el :results none
    (use-package python-mode
      :ensure t
      :straight t
      :hook (python-mode . lsp-deferred)
      :custom
      (dap-python-debuffer 'debugpy)
      :config
      (require 'dap-python)

  )
#+end_src
Setup emacs to use `virtualenv`.  The `pyenv-activate` command will tell `lsp-mode` and `dap-mode` to use the virtual env.
#+begin_src emacs-lisp :tangle ~/.emacs.d/init.el :results none
  (use-package pyvenv
  :ensure t
  :straight t
  :config
    (pyvenv-mode 1))

#+end_src
** Term mode colors
The =eterm-256color= enchances the output of =term-mode=. It requires =ncurses=. You can get that with you package manager (including with =brew install ncurses= on mac).
#+begin_src emacs-lisp :tangle ~/.emacs.d/init.el :results none
    (use-package eterm-256color
  :ensure t
  :straight t
  :hook (term-mode . eterm-256color-mode))

#+end_src

** Vterm
Vterm is a more modern terminal for Emacs and is quite faster than =term=.
#+begin_src emacs-lisp :tangle ~/.emacs.d/init.el :results none
  (use-package vterm
    :ensure t
    :straight t
    :commands vterm
    :config
    (setq term-prompt-regexp "^[^#$%>\n]*[#$%>] *")
    (setq vterm-max-scrollback 1000)
    )
#+end_src
*** TODO Need to handle the compiler properly to get this to work.


* Configure Dap
#+begin_src emacs-lisp :tangle ~/.emacs.d/init.el :results none* Configure Dap
  (use-package dap-mode
    :ensure t
    :straight t

    :custom
    (lsp-enable-dap-auto-configure t)
    :config
    (dap-ui-mode +1)

    (general-define-key
     :prefix "SPC"
     :keymaps 'override
     :states '(normal motion visual)
     "HD" '(dap-hydra :which-key "Debug")))
 #+end_src

#+end_src
